In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
lst = ['Geeks', 'For', 'Geeks', 'is', 
            'portal', 'for', 'Geeks']

In [3]:
df = pd.DataFrame(data=lst)

In [4]:
df

        0
0   Geeks
1     For
2   Geeks
3      is
4  portal
5     for
6   Geeks

In [5]:
data = {'Name':['Tom', 'nick', 'krish', 'jack'],
        'Age':[20, 21, 19, 18]}
df2 = pd.DataFrame(data=data)

In [6]:
df2

    Name  Age
0    Tom   20
1   nick   21
2  krish   19
3   jack   18

In [7]:
df2.head(3)

    Name  Age
0    Tom   20
1   nick   21
2  krish   19

In [8]:
df2.tail()

    Name  Age
0    Tom   20
1   nick   21
2  krish   19
3   jack   18

In [9]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 192.0+ bytes

In [10]:
df2.size

8

In [11]:
df2.shape

(4, 2)

In [12]:
df2.columns

Index(['Name', 'Age'], dtype='object')

In [13]:
df2.dtypes

Name    object
Age      int64
dtype: object

## Dealing with rows and columns

In [14]:
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}
Data = pd.DataFrame(data=data)

In [15]:
Data

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd

# Row selections

In [16]:
Data.loc[[0]]

  Name  Age Address Qualification
0  Jai   27   Delhi           Msc

In [17]:
Data.loc[0]

Name               Jai
Age                 27
Address          Delhi
Qualification      Msc
Name: 0, dtype: object

In [18]:
Data.loc[[0,1],['Name','Address','Qualification']]

     Name Address Qualification
0     Jai   Delhi           Msc
1  Princi  Kanpur            MA

# using iloc() method. iloc --> integer location

In [19]:
Data.iloc[0]

Name               Jai
Age                 27
Address          Delhi
Qualification      Msc
Name: 0, dtype: object

In [20]:
Data.iloc[[0,1],[0,1,2]]

     Name  Age Address
0     Jai   27   Delhi
1  Princi   24  Kanpur

# import csv_file

In [21]:
my_df = pd.read_csv('nba.csv',index_col="Name")

In [22]:
my_df

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...
Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [23]:
my_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 458 entries, Avery Bradley to nan
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Team      457 non-null    object
 1   Number    457 non-null    float64
 2   Position  457 non-null    object
 3   Age       457 non-null    float64
 4   Height    457 non-null    object
 5   Weight    457 non-null    float64
 6   College   373 non-null    object
 7   Salary    446 non-null    float64
dtypes: float64(4), object(4)
memory usage: 32.2+ KB

In [24]:
first = my_df.loc[['Avery Bradley']]
second = my_df.loc['R.J. Hunter']

In [25]:
first

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0

In [26]:
second

Team        Boston Celtics
Number                  28
Position                SG
Age                     22
Height                 6-5
Weight                 185
College      Georgia State
Salary         1.14864e+06
Name: R.J. Hunter, dtype: object

In [27]:
my_df

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...
Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

# Selecting a single columns

In [28]:
Age = my_df[['Age']]

In [29]:
Age

                Age
Name
Avery Bradley  25.0
Jae Crowder    25.0
John Holland   27.0
R.J. Hunter    22.0
Jonas Jerebko  29.0
...             ...
Shelvin Mack   26.0
Raul Neto      24.0
Tibor Pleiss   26.0
Jeff Withey    26.0
NaN             NaN

[458 rows x 1 columns]

# working with missing data

In [30]:
dict = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score':[np.nan, 40, 80, 98]}
 
my_dict = pd.DataFrame(dict)

In [31]:
my_dict

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         95.0           NaN         98.0

In [32]:
my_dict.isnull()

   First Score  Second Score  Third Score
0        False         False         True
1        False         False        False
2         True         False        False
3        False          True        False

In [33]:
my_dict.notnull()

   First Score  Second Score  Third Score
0         True          True        False
1         True          True         True
2        False          True         True
3         True         False         True

# Filling missing values using fillna(), replace() and interpolate()

In [34]:
my_dict

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         95.0           NaN         98.0

In [35]:
my_dict.fillna(value=20)

   First Score  Second Score  Third Score
0        100.0          30.0         20.0
1         90.0          45.0         40.0
2         20.0          56.0         80.0
3         95.0          20.0         98.0

In [36]:
my_dict.replace(to_replace=100,value=200)

   First Score  Second Score  Third Score
0        200.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         95.0           NaN         98.0

# Dropping missing values using dropna()

In [37]:
dict2 = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, np.nan, 45, 56],
        'Third Score':[52, 40, 80, 98],
        'Fourth Score':[np.nan, np.nan, np.nan, 65]}
my_dict2 = pd.DataFrame(data=dict2)

In [38]:
my_dict2

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0           52           NaN
1         90.0           NaN           40           NaN
2          NaN          45.0           80           NaN
3         95.0          56.0           98          65.0

In [39]:
my_dict2.dropna()

   First Score  Second Score  Third Score  Fourth Score
3         95.0          56.0           98          65.0

In [40]:
my_dict2.loc[[3],['Fourth Score']] = np.nan

In [41]:
my_dict2

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0           52           NaN
1         90.0           NaN           40           NaN
2          NaN          45.0           80           NaN
3         95.0          56.0           98           NaN

In [42]:
my_dict2.dropna(how='all',axis='columns')

   First Score  Second Score  Third Score
0        100.0          30.0           52
1         90.0           NaN           40
2          NaN          45.0           80
3         95.0          56.0           98

In [43]:
my_dict2.drop(labels='Third Score',axis=1)

   First Score  Second Score  Fourth Score
0        100.0          30.0           NaN
1         90.0           NaN           NaN
2          NaN          45.0           NaN
3         95.0          56.0           NaN

# Iterating over rows and columns

In [44]:
dict3 = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score':[90, 40, 80, 98]}

my_dict3 = pd.DataFrame(data=dict3)

In [45]:
my_dict3

     name  degree  score
0  aparna     MBA     90
1  pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     MBA     98

In [46]:
for i,j in my_dict3.iterrows():
    print(i,j)
    print()

0 name      aparna
degree       MBA
score         90
Name: 0, dtype: object

1 name      pankaj
degree       BCA
score         40
Name: 1, dtype: object

2 name      sudhir
degree    M.Tech
score         80
Name: 2, dtype: object

3 name      Geeku
degree      MBA
score        98
Name: 3, dtype: object